{
    "jobs": [
        {
            "job_id": "job_101",
            "job_title": "Software Engineer Intern",
            "company": "Adobe",
            "description": "Adobe is seeking talented and passionate Software Engineer interns across all organizations to help plan, design, develop, and test software systems or applications for software enhancements and new products used in local, networked, cloud-based or Internet-related computer programs and products.\n\nAdobe software engineer interns can work directly on products for our Creative Cloud, Document Cloud, or Experience Cloud teams, or they can be immersed in the world of our cloud-based platform - diving into components of our infrastructure or solving problems with big data. We have openings for all interests – web developers, mobile developers, data engineers, frontend development, back–end development, full stack development - the opportunities are endless!\n\nWhat You'll Do\n\nDevelop high-performance, reliable, testable and maintainable code.\nParticipating in all aspects of software development activities, including design, coding, code review, testing, bug fixing, and code/API documentation.\nCollaborate with engineers and participate in daily or weekly stand ups and meetings.\nGrow with the support of your team and help others on the team grow by providing thoughtful feedback and uplifting those around you.\nWork both independently and collaboratively within a fast-paced development team, with clear, positive, and constructive communication.\n\nWhat You Need To Succeed\n\nCurrently enrolled full time and pursuing a Bachelor's or Master's in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience required\nStrong technical background with analytical and problem-solving skills\nPrevious related experience in software engineering (applicable coursework, projects, internships, etc.)\nProficiency and experience with at least one or more of the following: Java, C++, JavaScript, Python\nFamiliar with the software development lifecycle\nResults-oriented, with ability and interest in learning new technologies"
        },
        {
            "job_id": "job_102",
            "job_title": "Robotics Software Engineer",
            "company": "Amazon Robotics",
            "description": "Are you inspired by invention? Is problem solving through teamwork in your DNA? Do you like the idea of seeing how your work impacts the bigger picture? Answer yes to any of these and you'll fit right in here at Amazon Robotics. We are a smart team of doers who work passionately to apply cutting edge advances in robotics and software to solve real-world challenges that will transform our customers' experiences.\n\nAmazon Robotics empowers a smarter, faster, more consistent customer experience through automation. Amazon Robotics automates fulfillment center operations using various methods of robotic technology including autonomous mobile robots, sophisticated control software, language perception, power management, computer vision, depth sensing, machine learning, object recognition, and semantic understanding of commands.\n\nBasic Qualifications:\nKnowledge of computer science fundamentals such as object-oriented design, operating systems, algorithms, data structures, and complexity analysis\nExperience with at least one modern language such as Java, Python, C++, or C# including object-oriented design\n\nPreferred Qualifications:\nKnowledge of programming languages such as C/C++, Python, Java or Perl\nExperience with distributed, multi-tiered systems, algorithms, and relational databases\nExperience in optimization mathematics such as linear programming and nonlinear optimization"
        },
        {
            "job_id": "job_103",
            "job_title": "Business Systems Engineering Intern",
            "company": "Alo",
            "description": "We are seeking a motivated and technically strong intern to join our Business Systems Engineering team. This is an exciting opportunity to work on impactful, real-world projects that directly improve and optimize our current enterprise systems.\n\nRESPONSIBILITIES:\nWork closely with a team of 3rd party developers, delivering tech specs, answering questions, and providing feedback\nCollaborate with BA's and the Business to help define problem statements and solutions\nDesign, develop, and implement software solutions that align with business objectives\nUtilize object-oriented programming principles to architect scalable systems\nWrite clean, well-documented technical specifications\nCreate and maintain detailed technical documentation\n\nRequirements:\nCurrently pursuing or recently completed a degree in Computer Science\nTechnical skills in object-oriented programming languages such as Java, C++, or C#\nStrong problem-solving skills and ability to work in a fast-paced environment\nA passion for learning new technologies\nExcellent communication and teamwork skills"
        },
        {
            "job_id": "job_104",
            "job_title": "AI/ML Infrastructure Software Engineer",
            "company": "NVIDIA",
            "description": "We are currently hiring an AI/ML Infrastructure Software Engineer at NVIDIA to join our Hardware Infrastructure team. As an Engineer, you will play a crucial role in boosting productivity for our researchers through implementing advancements across the entire stack.\n\nWhat You Will Be Doing:\nCollaborate with AI and ML research teams to understand infrastructure needs\nMonitor and optimize infrastructure performance\nHelp define and improve AI researcher efficiency metrics\nCollaborate with diverse teams to build a seamless AI/ML infrastructure ecosystem\n\nWhat We Need To See:\nBS or equivalent experience in Computer Science with 5+ years of proven experience in AI/ML and HPC workloads\nHands-on experience with HPC infrastructure, GPU computing, storage systems, and containers\nExpertise in distributed training workloads using PyTorch, NeMo, or JAX\nProficiency in Python, Go, Bash, and cloud computing platforms\nPassion for continual learning in AI/ML infrastructure\nExcellent communication and collaboration skills"
        },
        {
            "job_id": "job_105",
            "job_title": "Machine Learning Research Intern",
            "company": "InstaDeep",
            "description": "InstaDeep is a pioneering AI company at the forefront of innovation. We design the internship to focus on challenging applications where we can test our ideas and improve upon previous work.\n\nResponsibilities:\nWork alongside research engineers investigating approaches to solving problems\nInvestigate and establish performance baselines\nExtend investigation with cutting-edge machine learning techniques\nResearch latest developments in the area\nBe methodical about running and documenting experiments\nProduce quality code using software engineering best practices\n\nRequirements:\nUndergraduate or graduate degree in Computer Science, Mathematics or related field\nKnowledge in and experience with deep learning\nExperience developing and debugging in Python\nExperience using deep learning frameworks like PyTorch, Tensorflow and/or Jax\nResearch and software engineering experience\nExcellent communication skills in English\nWork permit for internship in the US\nOnsite 5 days per week"
        }
    ]
}